# DividedpathJustification Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..DividedpathJustification Property
ParameterTypeId Class See Also
---
"Justification"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId DividedpathJustification { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DividedpathJustification As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ DividedpathJustification {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace